In [6]:
import pandas as pd

In [7]:
df = pd.read_csv('data/VisaDataset.csv')

In [8]:
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [9]:
df.shape

(25480, 12)

In [10]:
data = df.to_dict(orient="records")

In [11]:
data[0]

{'case_id': 'EZYV01',
 'continent': 'Asia',
 'education_of_employee': 'High School',
 'has_job_experience': 'N',
 'requires_job_training': 'N',
 'no_of_employees': 14513,
 'yr_of_estab': 2007,
 'region_of_employment': 'West',
 'prevailing_wage': 592.2029,
 'unit_of_wage': 'Hour',
 'full_time_position': 'Y',
 'case_status': 'Denied'}

In [12]:
len(data)

25480

In [13]:
from src.visa_verdict.utils.monogdb_utilities import MongoDBUtilities

In [14]:
mongo = MongoDBUtilities(db_name="visa_verdict", collection_name="raw_data")

[ 2024-09-10 14:20:13,928 ] 16 root - INFO - Connecting to MongoDB! Database: visa_verdict, Collection: raw_data
[ 2024-09-10 14:20:16,895 ] 26 root - INFO - Connected to MongoDB! Database: visa_verdict, Collection: raw_data

In [15]:
# mongo.insert_many(data)

In [17]:
df = mongo.read_all_as_df()
df.head()

,_id,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,66e0043d3a37c95ef65fc742,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,66e0043d3a37c95ef65fc743,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,66e0043d3a37c95ef65fc744,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,66e0043d3a37c95ef65fc745,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,66e0043d3a37c95ef65fc746,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [18]:
if "_id" in df.columns.to_list():
    df = df.drop(columns=["_id"], axis=1)

In [19]:
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified